In [42]:
"""STEP3: Perform some simple data analysis
Start by connecting to the database by running the cells below. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed steps 1 and 2, then skip to the second cell."""

'STEP3: Perform some simple data analysis\nStart by connecting to the database by running the cells below. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed steps 1 and 2, then skip to the second cell.'

In [43]:
#!PGPASSWORD=student createdb -h 127.0.0.1 -p 5433 -U student pagila
#!PGPASSWORD=student psql -q -h 127.0.0.1 -p 5433  -U student -d pagila -f Data/pagila-schema.sql
#!PGPASSWORD=student psql -q -h 127.0.0.1 -p 5433  -U student -d pagila -f Data/pagila-data.sql

In [44]:
%load_ext sql
DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'postgres'
DB_PASSWORD = 'Otieno@1125'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}"\
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT,DB)

print(conn_string)
%sql $conn_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
postgresql://postgres:Otieno@1125@127.0.0.1:5432/pagila

'Connected: postgres@pagila'

In [45]:
"""3.1 Insight 1: Top Grossing Movies
Payments amounts are in table payment
Movies are in table film
They are not directly linked, payment refers to a rental, rental refers to an inventory item and inventory item refers to a film
payment → rental → inventory → film"""

'3.1 Insight 1: Top Grossing Movies\nPayments amounts are in table payment\nMovies are in table film\nThey are not directly linked, payment refers to a rental, rental refers to an inventory item and inventory item refers to a film\npayment → rental → inventory → film'

In [46]:
%%sql
select film_id, title, release_year, rental_rate, rating from film limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 2006, Decimal('0.99'), 'PG'),
 (2, 'ACE GOLDFINGER', 2006, Decimal('4.99'), 'G'),
 (3, 'ADAPTATION HOLES', 2006, Decimal('2.99'), 'NC-17'),
 (4, 'AFFAIR PREJUDICE', 2006, Decimal('2.99'), 'G'),
 (5, 'AFRICAN EGG', 2006, Decimal('2.99'), 'G')]

In [47]:
%%sql
select * from payment limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2007, 1, 24, 21, 40, 19, 996577)),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2007, 1, 25, 15, 16, 50, 996577)),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2007, 1, 28, 21, 44, 14, 996577)),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2007, 1, 29, 0, 58, 2, 996577)),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2007, 1, 29, 8, 10, 6, 996577))]

In [48]:
"""3.1.3 Inventory"""

'3.1.3 Inventory'

In [49]:
%%sql
select * from inventory limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (2, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (3, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (4, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (5, 1, 2, datetime.datetime(2006, 2, 15, 10, 9, 17))]

In [50]:
"""3.1.4 Get the movie of every payment"""

'3.1.4 Get the movie of every payment'

In [51]:
%%sql
select f.title, p.amount, p.payment_date, p.customer_id
from payment p
join rental r on(p.rental_id = r.rental_id)
join inventory i on(r.inventory_id = i.inventory_id)
join film f on(i.film_id = f.film_id)
limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[('SWARM GOLD', Decimal('1.99'), datetime.datetime(2007, 1, 24, 21, 40, 19, 996577), 269),
 ('PACKER MADIGAN', Decimal('0.99'), datetime.datetime(2007, 1, 25, 15, 16, 50, 996577), 269),
 ('SOMETHING DUCK', Decimal('6.99'), datetime.datetime(2007, 1, 28, 21, 44, 14, 996577), 269),
 ('DRACULA CRYSTAL', Decimal('0.99'), datetime.datetime(2007, 1, 29, 0, 58, 2, 996577), 269),
 ('CLOSER BANG', Decimal('4.99'), datetime.datetime(2007, 1, 29, 8, 10, 6, 996577), 269)]

In [52]:
"""3.1.5 sum movie rental revenue"""

'3.1.5 sum movie rental revenue'

In [53]:
%%sql
select f.title, sum(p.amount) as revenue
from payment p
join rental r on(p.rental_id = r.rental_id)
join inventory i on(r.inventory_id = i.inventory_id)
join film f on(i.film_id = f.film_id)
group by 1
order by 2 desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('TELEGRAPH VOYAGE', Decimal('231.73')),
 ('WIFE TURN', Decimal('223.69')),
 ('ZORRO ARK', Decimal('214.69')),
 ('GOODFELLAS SALUTE', Decimal('209.69')),
 ('SATURDAY LAMBS', Decimal('204.72')),
 ('TITANS JERK', Decimal('201.71')),
 ('TORQUE BOUND', Decimal('198.72')),
 ('HARRY IDAHO', Decimal('195.70')),
 ('INNOCENT USUAL', Decimal('191.74')),
 ('HUSTLER PARTY', Decimal('190.78'))]

In [54]:
"""title	revenue
TELEGRAPH VOYAGE	231.73
WIFE TURN	223.69
ZORRO ARK	214.69
GOODFELLAS SALUTE	209.69
SATURDAY LAMBS	204.72
TITANS JERK	201.71
TORQUE BOUND	198.72
HARRY IDAHO	195.70
INNOCENT USUAL	191.74
HUSTLER PARTY	190.78"""

'title\trevenue\nTELEGRAPH VOYAGE\t231.73\nWIFE TURN\t223.69\nZORRO ARK\t214.69\nGOODFELLAS SALUTE\t209.69\nSATURDAY LAMBS\t204.72\nTITANS JERK\t201.71\nTORQUE BOUND\t198.72\nHARRY IDAHO\t195.70\nINNOCENT USUAL\t191.74\nHUSTLER PARTY\t190.78'

In [55]:
"""3.2 Insight 2: Top grossing cities
Payments amounts are in table payment
Cities are in table cities
payment → customer → address → city"""

'3.2 Insight 2: Top grossing cities\nPayments amounts are in table payment\nCities are in table cities\npayment → customer → address → city'

In [56]:
"""3.2.1 Get the city of each payment"""

'3.2.1 Get the city of each payment'

In [57]:
%%sql
select p.customer_id, p.rental_id, p.amount, ci.city
from payment p 
join customer c on(p.customer_id = c.customer_id)
join address a  on(c.address_id = a.address_id)
join city ci on(a.city_id = ci.city_id)
order by p.payment_date
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[(130, 1, Decimal('2.99'), 'guas Lindas de Gois'),
 (459, 2, Decimal('2.99'), 'Qomsheh'),
 (408, 3, Decimal('3.99'), 'Jaffna'),
 (333, 4, Decimal('4.99'), 'Baku'),
 (222, 5, Decimal('6.99'), 'Jaroslavl'),
 (549, 6, Decimal('0.99'), 'Santiago de Compostela'),
 (269, 7, Decimal('1.99'), 'Salinas'),
 (239, 8, Decimal('4.99'), 'Ciomas'),
 (126, 9, Decimal('4.99'), 'Po'),
 (399, 10, Decimal('5.99'), 'Okara')]

In [58]:
"""3.2.2 Top grossing cities"""

'3.2.2 Top grossing cities'

In [59]:
%%sql
select ci.city, sum(p.amount) as revenue
from payment p
join customer c on(p.customer_id = c.customer_id)
join address a on(c.address_id = a.address_id)
join city ci on(a.city_id = ci.city_id)
group by 1
order by 2 desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('Cape Coral', Decimal('221.55')),
 ('Saint-Denis', Decimal('216.54')),
 ('Aurora', Decimal('198.50')),
 ('Molodetno', Decimal('195.58')),
 ('Santa Brbara dOeste', Decimal('194.61')),
 ('Apeldoorn', Decimal('194.61')),
 ('Qomsheh', Decimal('186.62')),
 ('London', Decimal('180.52')),
 ('Ourense (Orense)', Decimal('177.60')),
 ('Bijapur', Decimal('175.61'))]

In [60]:
"""city	revenue
Cape Coral	221.55
Saint-Denis	216.54
Aurora	198.50
Molodetno	195.58
Apeldoorn	194.61
Santa Brbara dOeste	194.61
Qomsheh	186.62
London	180.52
Ourense (Orense)	177.60
Bijapur	175.61
"""

'city\trevenue\nCape Coral\t221.55\nSaint-Denis\t216.54\nAurora\t198.50\nMolodetno\t195.58\nApeldoorn\t194.61\nSanta Brbara dOeste\t194.61\nQomsheh\t186.62\nLondon\t180.52\nOurense (Orense)\t177.60\nBijapur\t175.61\n'

In [61]:
"""3.3 Insight 3 : Revenue of a movie by customer city and by month"""

'3.3 Insight 3 : Revenue of a movie by customer city and by month'

In [62]:
"""3.3.1 Total revenue by month"""

'3.3.1 Total revenue by month'

In [63]:
%%sql
select sum(p.amount) as revenue, extract(month from p.payment_date) as month
from payment p
group by 2
order by 1 desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(Decimal('28559.46'), 4.0),
 (Decimal('23886.56'), 3.0),
 (Decimal('9631.88'), 2.0),
 (Decimal('4824.43'), 1.0),
 (Decimal('514.18'), 5.0)]

In [64]:
"""3.3.2 Each movie by customer city and by month (data cube)"""

'3.3.2 Each movie by customer city and by month (data cube)'

In [65]:
%%sql
select f.title, p.amount, p.customer_id, ci.city, p.payment_date, extract(month from p.payment_date) as month
from payment p
join rental r on(p.rental_id = r.rental_id)
join inventory i on(r.inventory_id = i.inventory_id)
join film f on(i.film_id = f.film_id)
join customer c on(p.customer_id = c.customer_id)
join address a on(c.address_id = a.address_id)
join city ci on(a.city_id = ci.city_id)
order by 5
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('BLANKET BEVERLY', Decimal('2.99'), 130, 'guas Lindas de Gois', datetime.datetime(2007, 1, 24, 21, 21, 56, 996577), 1.0),
 ('FREAKY POCUS', Decimal('2.99'), 459, 'Qomsheh', datetime.datetime(2007, 1, 24, 21, 22, 59, 996577), 1.0),
 ('GRADUATE LORD', Decimal('3.99'), 408, 'Jaffna', datetime.datetime(2007, 1, 24, 21, 32, 5, 996577), 1.0),
 ('LOVE SUICIDES', Decimal('4.99'), 333, 'Baku', datetime.datetime(2007, 1, 24, 21, 33, 7, 996577), 1.0),
 ('IDOLS SNATCHERS', Decimal('6.99'), 222, 'Jaroslavl', datetime.datetime(2007, 1, 24, 21, 33, 47, 996577), 1.0),
 ('MYSTIC TRUMAN', Decimal('0.99'), 549, 'Santiago de Compostela', datetime.datetime(2007, 1, 24, 21, 36, 33, 996577), 1.0),
 ('SWARM GOLD', Decimal('1.99'), 269, 'Salinas', datetime.datetime(2007, 1, 24, 21, 40, 19, 996577), 1.0),
 ('LAWLESS VISION', Decimal('4.99'), 239, 'Ciomas', datetime.datetime(2007, 1, 24, 22, 0, 12, 996577), 1.0),
 ('MATRIX SNOWMAN', Decimal('4.99'), 126, 'Po', datetime.datetime(2007, 1, 24, 22, 29, 6, 996577), 1.0),
 ('HANGING DEEP', Decimal('5.99'), 399, 'Okara', datetime.datetime(2007, 1, 24, 22, 30, 47, 996577), 1.0)]

In [66]:
"""3.3.3 Sum of revenue of each movie by customer city and by month
TODO: Write a query that returns the total amount of revenue for each movie by customer city and by month. Limit the results to the top 10 movies. Your result should match the table below."""

'3.3.3 Sum of revenue of each movie by customer city and by month\nTODO: Write a query that returns the total amount of revenue for each movie by customer city and by month. Limit the results to the top 10 movies. Your result should match the table below.'

In [67]:
%%sql
select f.title, ci.city, extract(month from p.payment_date) as month, sum(p.amount) as revenue
from payment p
join rental r on(p.rental_id  = r.rental_id)
join inventory i on(r.inventory_id = i.inventory_id)
join film f on(i.film_id = f.film_id)
join customer c on(p.customer_id = c.customer_id)
join address a on(c.address_id = a.address_id)
join city ci on(a.city_id = ci.city_id)
group by 1,2,3
order by 3,4
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[('ANNIE IDENTITY', 'Tel Aviv-Jaffa', 1.0, Decimal('0.99')),
 ('ALONE TRIP', 'Arak', 1.0, Decimal('0.99')),
 ('ALTER VICTORY', 'Vinh', 1.0, Decimal('0.99')),
 ('ANACONDA CONFESSIONS', 'Fengshan', 1.0, Decimal('0.99')),
 ('ALAMO VIDEOTAPE', 'Arecibo', 1.0, Decimal('0.99')),
 ('ALASKA PHANTOM', 'Nezahualcyotl', 1.0, Decimal('0.99')),
 ('ACADEMY DINOSAUR', 'Celaya', 1.0, Decimal('0.99')),
 ('ALTER VICTORY', 'Ezhou', 1.0, Decimal('0.99')),
 ('AMADEUS HOLY', 'La Plata', 1.0, Decimal('0.99')),
 ('ARABIA DOGMA', 'Tartu', 1.0, Decimal('0.99'))]

In [68]:
"""title	city	month	revenue
SHOW LORD	Mannheim	1.0	11.99
AMERICAN CIRCUS	Callao	1.0	10.99
CASUALTIES ENCINO	Warren	1.0	10.99
TELEGRAPH VOYAGE	Naala-Porto	1.0	10.99
KISSING DOLLS	Toulon	1.0	10.99
MILLION ACE	Bergamo	1.0	9.99
TITANS JERK	Kimberley	1.0	9.99
DARKO DORADO	Bhilwara	1.0	9.99
SUNRISE LEAGUE	Nagareyama	1.0	9.99
MILLION ACE	Gaziantep	1.0	9.99
"""

'title\tcity\tmonth\trevenue\nSHOW LORD\tMannheim\t1.0\t11.99\nAMERICAN CIRCUS\tCallao\t1.0\t10.99\nCASUALTIES ENCINO\tWarren\t1.0\t10.99\nTELEGRAPH VOYAGE\tNaala-Porto\t1.0\t10.99\nKISSING DOLLS\tToulon\t1.0\t10.99\nMILLION ACE\tBergamo\t1.0\t9.99\nTITANS JERK\tKimberley\t1.0\t9.99\nDARKO DORADO\tBhilwara\t1.0\t9.99\nSUNRISE LEAGUE\tNagareyama\t1.0\t9.99\nMILLION ACE\tGaziantep\t1.0\t9.99\n'